In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

In [5]:
df = pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [15]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [9]:
df.fillna(value = 'fill value')

            A           B  C
0         1.0         5.0  1
1         2.0  fill value  2
2  fill value  fill value  3

In [12]:
df.fillna('fill value')

            A           B  C
0         1.0         5.0  1
1         2.0  fill value  2
2  fill value  fill value  3

In [16]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [17]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [18]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [19]:
df = pd.DataFrame(data)

In [20]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [26]:
byComp = df.groupby('Company')

In [27]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [28]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [29]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [33]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340